app/helpers/sessions_helper.rb

  def current_user
    User.find(current_user_id) if signed_in?
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]