app/controllers/opinions_controller.rb

SELECT "opinions".* FROM "opinions" ORDER BY created_at DESC
SELECT "users".* FROM "users"
---
  def index
    @opinions = Opinion.all.order('created_at DESC')
    @users = User.all