app/controllers/users_controller.rb

  def show
    @users = User.all
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users"
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @user = User.create(user_params)
    if @user.save
      @user = User.find_by(username: @user.username)
---
INSERT INTO "users" ("created_at", "updated_at", "username", "fullname") VALUES (?, ?, ?, ?)  [["created_at", "2020-06-11 06:35:04.869831"], ["updated_at", "2020-06-11 06:35:04.869831"], ["username", "mariosknl2"], ["fullname", "marios kanellopoulos"]]
UPDATE "users" SET "updated_at" = ? WHERE "users"."id" = ?  [["updated_at", "2020-06-11 10:54:49.541580"], ["id", 7]]
INSERT INTO "users" ("created_at", "updated_at", "username", "fullname") VALUES (?, ?, ?, ?)  [["created_at", "2020-06-11 06:32:51.882069"], ["updated_at", "2020-06-11 06:32:51.882069"], ["username", "mariosknl"], ["fullname", "marios kanellopoulos"]]
SELECT "users".* FROM "users" WHERE "users"."username" = ? LIMIT ?  [["username", "mariosknl"], ["LIMIT", 1]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "fullname" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["fullname", ""], ["updated_at", "2020-06-11 14:14:01.547123"], ["id", 3]]