app/models/user.rb

INSERT INTO "follows" ("followerid", "followedid", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["followerid", 1], ["followedid", 3], ["created_at", "2020-06-12 14:19:07.534335"], ["updated_at", "2020-06-12 14:19:07.534335"]]
---
  def follow(user)
    following = Follow.new(followerid: id, followedid: user.id)
    following.save